docs/tomoko/help.org
#+STARTUP: indent nolineimages
* 問題点
my_helpは個人の知識を貯めるものなのか，自分でカスタマイズできるメモなのか？
知識を共有を目指すのに，自分専用のメモアプリやとおかしい

1．アプリの本来の目標，現状の機能，利点の説明は冒頭に端的にまとめて説明．

2．現状のアプリから，さらに何をするかの説明．


- メモの形をとった，my_helpは個人の知識を貯めるもの．
(現在はemacs helpのようにしか使っていないが)今後はQiitaみたいなサイトのように書くようにする．

- wikiは信用性が低い．

* 記述
my_helpのすごいとこ
- terminal上のどのdirectoryにいても使えるとこ．
- なんども同じこと検索しなくていいこと．
- memoは覚えようとしてとる．memoをとることによって知識を自分のものにしようとする．覚えるまで何度も復習はしなあかんけど，覚えるまでにかかる毎回どのページのどの箇所に書かれてるか探す必要が省ける．
- list表示がすごいと思うねん．わざわざファイルの中を開くのって閉じる作業あってめんどいし，catすると全部出てしまう．cat だとターミナル上を一瞬で流れてしまうので、最後の1画面分以外は見ることができない．lessコマンドは一部分だけの表示？


