docs/tomoko/help.tex
% Created 2018-09-19 水 22:47
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{longtable}
\usepackage{float}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{marvosym}
\usepackage{wasysym}
\usepackage{amssymb}
\usepackage{hyperref}
\tolerance=1000
\author{Yamada Tomoko}
\date{\today}
\title{help}
\hypersetup{
  pdfkeywords={},
  pdfsubject={},
  pdfcreator={Emacs 25.3.1 (Org mode 8.2.10)}}
\begin{document}

\maketitle
\tableofcontents

\section{問題点}
\label{sec-1}
my$_{\text{helpは個人の知識を貯めるものなのか，自分でカスタマイズできるメモなのか？}}$
知識を共有を目指すのに，自分専用のメモアプリやとおかしい

1．アプリの本来の目標，現状の機能，利点の説明は冒頭に端的にまとめて説明．

2．現状のアプリから，さらに何をするかの説明．


\begin{itemize}
\item メモの形をとった，my$_{\text{helpは個人の知識を貯めるもの．}}$
\end{itemize}
(現在はemacs helpのようにしか使っていないが)今後はQiitaみたいなサイトのように書くようにする．

\begin{itemize}
\item wikiは信用性が低い．
\end{itemize}

\section{記述}
\label{sec-2}
my$_{\text{helpのすごいとこ}}$
\begin{itemize}
\item terminal上のどのdirectoryにいても使えるとこ．
\item なんども同じこと検索しなくていいこと．
\item memoは覚えようとしてとる．memoをとることによって知識を自分のものにしようとする．覚えるまで何度も復習はしなあかんけど，覚えるまでにかかる毎回どのページのどの箇所に書かれてるか探す必要が省ける．
\item list表示がすごいと思うねん．わざわざファイルの中を開くのって閉じる作業あってめんどいし，catすると全部出てしまう．cat だとターミナル上を一瞬で流れてしまうので、最後の1画面分以外は見ることができない．lessコマンドは一部分だけの表示？
\end{itemize}
% Emacs 25.3.1 (Org mode 8.2.10)
\end{document}
